-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: db
-- Generation Time: Dec 27, 2023 at 10:26 AM
-- Server version: 8.0.32
-- PHP Version: 8.2.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+07:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `spbkpiv1`
--

-- --------------------------------------------------------

--
-- Table structure for table `detail`
--

CREATE TABLE `detail` (
  `de_id` int NOT NULL,
  `fm_id` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `de_qur` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `de_paras` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `de_ans` float NOT NULL,
  `de_result` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `event`
--

CREATE TABLE `event` (
  `ev_id` int NOT NULL,
  `de_id` int NOT NULL,
  `fms_id` varchar(5) COLLATE utf8mb4_general_ci NOT NULL,
  `ev_name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_res` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_status` int NOT NULL,
  `ev_budget` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_buded` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_point` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_target` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_result` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_problem` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ev_str` int NOT NULL DEFAULT '1',
  `ev_img` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `form`
--

CREATE TABLE `form` (
  `fm_id` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `fm_name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `fm_solve` int NOT NULL,
  `fm_method` int NOT NULL,
  `fm_define` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `fm_paras` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `fm_com` tinyint(1) NOT NULL DEFAULT '0',
  `fm_con` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `fm_numpara` int NOT NULL,
  `fm_res` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `form`
--

INSERT INTO `form` (`fm_id`, `fm_name`, `fm_solve`, `fm_method`, `fm_define`, `fm_paras`, `fm_com`, `fm_con`, `fm_numpara`, `fm_res`) VALUES
('1', 'KR 1 : จำนวนประชาชนที่เข้ารับบริการกับคลินิกสุขภาพเพศหลากหลายเพิ่มขึ้นและได้รับการตรวจคัดกรอง HIV (P015)', 100, 2, 'นิยาม\nจำนวนประชาชนที่เข้ารับบริการคลินิกสุขภาพเพศหลากหลาย หมายถึง จำนวนประชาชนที่เข้ารับบริการคลินิกสุขภาพเพศหลากหลายทั้งหมดในปีงบประมาณ 2567\n\nวิธีการคำนวณ\nนับจำนวนผู้รับบริการ\n', 'จำนวนผู้มารับบริการในคลินิกสุขภาพเพศหลากหลาย*', 1, '0', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('1.1', 'KPI 1.5.1.1 : ประชาชนทุกช่วงวัยมีความรอบรู้ด้านสุขภาพ (เยาวชน)', 30, 1, 'นิยาม \nประชาชนทุกช่วงวัยมีความรอบรู้ด้านสุขภาพ หมายถึง กลุ่มเยาวชนและกลุ่มวัยทำงาน ที่เข้าร่วมกิจกรรมโรงเรียนพ่อแม่มีความรู้ด้านสุขภาพที่ถูกต้องโดยมีคะแนนแบบทดสอบความรู้หลังเข้าร่วมกิจกรรมโรงเรียนพ่อ-แม่มากกว่าหรือเท่ากับร้อยละ 80\n\nวิธีการคำนวณ\nจำนวนผู้รับบริการในกิจกรรมโรงเรียนพ่อ-แม่ที่มีคะแนนแบบทดสอบหลังเข้าร่วมกิจกรรมโรงเรียนพ่อแม่มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80 หารด้วย จำนวนผู้รับบริการในกิจกรรมโรงเรียนพ่อ-แม่ที่มีทำแบบทดสอบหลังเข้าร่วมกิจกรรมโรงเรียนพ่อแม่ทั้งหมด คูณด้วย 100', 'สูติ-นรีเวชกรรม_ช่วงอายุ 10-14 ปี_ผู้ร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 15-19 ปี_ผู้ร่วมกิจกรรม, สูติ-นรีเวชกรรม_รวมผู้ร่วมกิจกรรม_ผู้ร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 10-14 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 15-19 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, สูติ-นรีเวชกรรม_รวมผู้ทำแบบทดสอบหลังร่วมกิจกรรม_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 10-14 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, สูติ-นรีเวชกรรม_ช่วงอายุ 15-19 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, สูติ-นรีเวชกรรม_รวมผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 10-14 ปี_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 15-19 ปี_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_รวมผู้ร่วมกิจกรรม_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 10-14 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 15-19 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_รวมผู้ทำแบบทดสอบหลังร่วมกิจกรรม_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 10-14 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 15-19 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_รวมผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 10-14 ปี_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 15-19 ปี_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_รวมผู้ร่วมกิจกรรม_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 10-14 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 15-19 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_รวมผู้ทำแบบทดสอบหลังร่วมกิจกรรม_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 10-14 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 15-19 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_รวมผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, ผู้เข้าร่วมกิจกรรมทั้งหมด, ผู้ทำแบบทดสอบหลังร่วมกิจกรรม ของ สูติ-นรีเวชกรรม และ กุมารเวชกรรม ครั้งที่ 2 และ ครั้งที่ 3 ทั้งหมด*, ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80 ของ สูติ-นรีเวชกรรม และ กุมารเวชกรรม ครั้งที่ 2 และ ครั้งที่ 3 ทั้งหมด*', 1, '0', 29, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('1.2', 'KPI 1.5.1.1 : ประชาชนทุกช่วงวัยมีความรอบรู้ด้านสุขภาพ (วัยทำงาน)', 60, 1, 'นิยาม \r\nประชาชนทุกช่วงวัยมีความรอบรู้ด้านสุขภาพ หมายถึง กลุ่มเยาวชนและกลุ่มวัยทำงาน ที่เข้าร่วมกิจกรรมโรงเรียนพ่อแม่มีความรู้ด้านสุขภาพที่ถูกต้องโดยมีคะแนนแบบทดสอบความรู้หลังเข้าร่วมกิจกรรมโรงเรียนพ่อ-แม่มากกว่าหรือเท่ากับร้อยละ 80\r\n\r\nวิธีการคำนวณ\r\nจำนวนผู้รับบริการในกิจกรรมโรงเรียนพ่อ-แม่ที่มีคะแนนแบบทดสอบหลังเข้าร่วมกิจกรรมโรงเรียนพ่อแม่มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80 หารด้วย จำนวนผู้รับบริการในกิจกรรมโรงเรียนพ่อ-แม่ที่มีทำแบบทดสอบหลังเข้าร่วมกิจกรรมโรงเรียนพ่อแม่ทั้งหมด คูณด้วย 100\r\n', 'สูติ-นรีเวชกรรม_ช่วงอายุ 20-24 ปี_ผู้ร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 35 ปีขึ้นไป_ผู้ร่วมกิจกรรม, สูติ-นรีเวชกรรม_รวมผู้ร่วมกิจกรรม_ผู้ร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 20-24 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 35 ปีขึ้นไป_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, สูติ-นรีเวชกรรม_รวมผู้ทำแบบทดสอบหลังร่วมกิจกรรม_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, สูติ-นรีเวชกรรม_ช่วงอายุ 20-24 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, สูติ-นรีเวชกรรม_ช่วงอายุ 35 ปีขึ้นไป_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, สูติ-นรีเวชกรรม_รวมผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 20-24 ปี_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 35 ปีขึ้นไป_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_รวมผู้ร่วมกิจกรรม_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 20-24 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 35 ปีขึ้นไป_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_รวมผู้ทำแบบทดสอบหลังร่วมกิจกรรม_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 20-24 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_ช่วงอายุ 35 ปีขึ้นไป_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 2 เด็กอายุ > 6-12 เดือน_รวมผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 20-24 ปี_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 35 ปีขึ้นไป_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_รวมผู้ร่วมกิจกรรม_ผู้ร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 20-24 ปี_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 35 ปีขึ้นไป_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_รวมผู้ทำแบบทดสอบหลังร่วมกิจกรรม_ผู้ทำแบบทดสอบหลังร่วมกิจกรรม, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 20-24 ปี_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_ช่วงอายุ 35 ปีขึ้นไป_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, กุมารเวชกรรม ครั้งที่ 3 เด็กอายุ > 12-18 เดือน_รวมผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80_ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80, ผู้เข้าร่วมกิจกรรมทั้งหมด, ผู้ทำแบบทดสอบหลังร่วมกิจกรรม ของ สูติ-นรีเวชกรรม และ กุมารเวชกรรม ครั้งที่ 2 และ ครั้งที่ 3 ทั้งหมด*, ผู้มีคะแนนมากกว่าหรือเท่ากับร้อยละ 80 ของ สูติ-นรีเวชกรรม และ กุมารเวชกรรม ครั้งที่ 2 และ ครั้งที่ 3 ทั้งหมด*', 1, '0', 29, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('12', 'KPI 1.5.7.2 : มีระบบการฟื้นฟูสุขภาพหลังจากการเจ็บป่วย', 90, 1, 'นิยาม : \n1. ผู้สูงอายุ คนพิการ หรือผู้ที่ประสบปัญหาทางการเคลื่อนไหว หมายถึง ผู้สูงอายุ คนพิการ หรือผู้ที่ประสบปัญหาทางการเคลื่อนไหวที่มารับบริการในโรงพยาบาลสังกัดสำนักการแพทย์\n2. กายอุปกรณ์ หมายถึง อุปกรณ์ทางการแพทย์ต่าง ๆ ที่ใช้กับร่างกายเพื่อช่วยเหลือการเคลื่อนไหว เช่น แขนเทียม ขาเทียม และอุปกรณ์ประคองหรือดามหลัง\nเป้าหมาย :\nผู้สูงอายุ คนพิการ หรือผู้ที่ประสบปัญหาทางการเคลื่อนไหว ไม่น้อยกว่าร้อยละ 90 \nได้รับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ที่จำเป็นต่อการดำรงชีวิตตามความต้องการและจำเป็น\n\n', 'จำนวนผู้มารับบริการในโรงพยาบาลที่ขอรับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_ผู้สูงอายุ    1.1, จำนวนผู้มารับบริการในโรงพยาบาลที่ขอรับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_คนพิการ    1.2, จำนวนผู้มารับบริการในโรงพยาบาลที่ขอรับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_คนพิการ    1.2, จำนวนผู้มารับบริการในโรงพยาบาลที่ขอรับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_รวม   (1) 1.2+1.2+1.3*, จำนวนผู้มารับบริการในโรงพยาบาลได้รับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_ผู้สูงอายุ    2.1, จำนวนผู้มารับบริการในโรงพยาบาลได้รับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_คนพิการ    2.2, จำนวนผู้มารับบริการในโรงพยาบาลได้รับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_ผุ้ประสบปัญหาทางการเคลื่อนไหว 2.3, จำนวนผู้มารับบริการในโรงพยาบาลได้รับการสนับสนุนอุปกรณ์ทางการแพทย์/กายอุปกรณ์ทั้งหมด (ราย)_รวม   (2) 2.2+2.2+2.3*', 1, '0', 9, '23, 20, 15, 14, 13, 19, 18, 12, 11, 17, 16, 10'),
('13', 'KPI 2.3.3 : ประชากรกลุ่มเปราะบางได้รับการบรรเทาผลกระทบฝุ่นละออง PM 2.5 ในช่วงวิกฤต', 98, 1, 'นิยาม\nกลุ่มเสี่ยง หมายถึง ผู้สูงอายุ เด็กเล็กหญิงตั้งครรภ์ ผู้ป่วยโรคระบบหัวใจและหลอดเลือดหรือโรคระบบทางเดินหายใจ\nการเฝ้าระวัง หมายถึง การให้ความรู้ความเข้าใจเกี่ยวกับการป้องกันมลพิษทางอากาศหรือแจกหน้ากากป้องกัน PM 2.5 หรือ N 95 ให้แก่ประชาชนกลุ่มเสี่ยงที่มารับบริการในคลินิกโรคทางเดินหายใจในโรงพยาบาลสังกัดสำนักการแพทย์\nวิธีการคำนวณ\nจำนวนประชากรกลุ่มเสี่ยงที่ได้รับผลกระทบจากมลพิษทางอากาศได้รับการรักษา หารด้วย จำนวนประชาชนกลุ่มเสี่ยงได้รับผลกระทบจากมลพิษทางอากาศทั้งหมด คูณด้วย 100', 'จำนวนประชาชนกลุ่มเสี่ยงได้รับผลกระทบจากมลพิษทางอากาศทั้งหมด\r\n(คน)*, จำนวนผู้ป่วยที่แพทย์วินิฉัยโรคที่เกิดจากมลพิษทางอากาศร่วมกับ Y 97 (คน), จำนวนผู้ป่วยที่แพทย์วินิฉัยโรคที่เกิดจากมลพิษทางอากาศร่วมกับ Z581 (คน), จำนวนผู้ป่วยที่แพทย์วินิฉัยโรคที่เกิดจากมลพิษทางอากาศร่วมกับ Z77 (คน), จำนวนประชากรกลุ่มเสี่ยงที่ได้รับผลกระทบจากมลพิษทางอากาศได้รับการรักษา (คน)*', 1, '0', 6, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('17', 'KR 2 : ร้อยละของคนเสี่ยงสูงที่เข้ามารับบริการคลินิกสุขภาพเพศหลากหลายต้องได้รับการตรวจคัดกรอง HIV (P015)', 95, 1, 'ประชาชนที่รับบริการคลินิกสุขภาพเพศหลากหลายได้รับการตรวจ HIV หมายถึง ประชาชนที่ไม่ใช่ผู้ติดเชื้อ HIV และมารับบริการในคลินิกสุขภาพเพศหลากหลายได้รับการตรวจคัดกรอง HIV\n\nวิธีการคำนวณ\nประชาชนกลุ่มเสี่ยงที่มารับบริการในคลินิกสุขภาพเพศหลากหลายและได้รับการตรวจ HIV หารด้วย ประชาชนกลุ่มเสี่ยงที่มารับบริการในคลินิกสุขภาพเพศทั้งหมด \nคูณด้วย 100\n', 'กลุ่มเสี่ยง (HIV) ที่มารับบริการในคลินิกสุขภาพเพศหลากหลาย*, กลุ่มเสี่ยง (HIV) ที่ได้รับการตรวจคัดกรอง*', 1, '0', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('19', 'KR 4 :ร้อยละของประชาชนที่แจ้งขอรับการช่วยเหลือผู้ประสบเหตุฉุกเฉินและด้านสุขภาพเชิงรุกถึงชุมชนจาก Motorlance (P155)', 100, 1, 'นิยาม\nประชาชนที่ได้รับการช่วยเหลือจาก Motorlance หมายถึง ประชาชนที่แจ้งเหตุขอความช่วยเหลือผู้เจ็บป่วยฉุกเฉินผ่านศูนย์รับแจ้งเหตุและสั่งการ และได้รับบริการด้วยรถจักรยานยนต์ฉุกเฉินทางการแพทย์ (Motorlance)\n\nวิธีการคำนวณ\nจำนวนประชาชนที่แจ้งเหตุขอความช่วยเหลือผู้เจ็บป่วยฉุกเฉินผ่านศูนย์รับแจ้งเหตุและสั่งการและได้รับการจัดบริการด้วยรถจักรยานยนต์ฉุกเฉินทางการแพทย์ (Motorlance) หารด้วยจำนวนประชาชนที่แจ้งเหตุขอความช่วยเหลือผู้เจ็บป่วยฉุกเฉินผ่านศูนย์รับแจ้งเหตุและสั่งการและต้องได้รับการจัดบริการด้วยรถจักรยานยนต์ฉุกเฉินทางการแพทย์ (Motorlance) ทั้งหมด คูณด้วย 100\n', 'จำนวนประชาชนที่แจ้งเหตุขอความช่วยเหลือผู้เจ็บป่วยฉุกเฉินผ่านศูนย์รับแจ้งเหตุและสั่งการและได้รับการจัดบริการด้วยรถจักรยานยนต์ฉุกเฉินทางการแพทย์ (Motorlance), จำนวนประชาชนที่แจ้งเหตุขอความช่วยเหลือผู้เจ็บป่วยฉุกเฉินผ่านศูนย์รับแจ้งเหตุและสั่งการและต้องได้รับการจัดบริการด้วยรถจักรยานยนต์ฉุกเฉินทางการแพทย์ (Motorlance) ทั้งหมด*', 1, '', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23'),
('2', 'ตัวชี้วัดที่ 1.5.2.1 : ประชาชนได้รับการคัดกรองสุขภาพเพิ่มขึ้นจากปีที่ผ่านมา ', 100, 2, 'นิยาม : \nการคัดกรองสุขภาพ หมายถึง การตรวจคัดกรองสุขภาพเบื้องต้น ตามเกณฑ์ที่สำนักงานหลักประกันสุขภาพแห่งชาติ (สปสช.) สำนักงานประกันสังคม และกรมบัญชีกลางกำหนด\n\nเอกสาร/หลักฐาน :\nแบบรายงานผลการดำเนินงานรายไตรมาส\n\nเป้าหมาย : \nเพิ่มขึ้นจำนวน 10,000 รายจากปี 2566', 'จำนวนการตรวจสุขภาพทุกช่วงวัย (ราย)_เด็กปฐมวัย (อายุ 0-5 ปี), จำนวนการตรวจสุขภาพทุกช่วงวัย (ราย)_เด็กวัยเรียน วัยรุ่น  (อายุ 6-18 ปี), จำนวนการตรวจสุขภาพทุกช่วงวัย (ราย)_วัยทำงาน (อายุ 19 -59 ปี), จำนวนการตรวจสุขภาพทุกช่วงวัย (ราย)_ผู้สูงอายุ (อายุ 60 ขึ้นไป), จำนวนการตรวจสุขภาพทุกช่วงวัย (ราย)_รวมทั้งสิ้น (ราย)*, จำนวนเป้าหมาย ปี 2567*', 1, '30000, 30000, 30000, 10000, 10000, 10000, 30000, 30000, 10000, 5000, 5000', 6, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('23', 'KR 8 : ร้อยละของคลินิกในโรงพยาบาลสังกัดสำนักการแพทย์ 11 แห่ง สามารถให้บริการด้านการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม(Telemedicine)(P154)', 30, 1, 'นิยาม\nคลินิกที่สามารถให้บริการด้านการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine) หมายถึง คลินิกในโรงพยาบาลสังกัดสำนักการแพทย์ที่มีการเปิดให้บริการผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine)\n\nวิธีการคำนวณ\nจำนวนคลินิกที่สามารถให้บริการด้านการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine) หารด้วย จำนวนคลินิกทั้งหมดในโรงพยาบาล คูณด้วย 100\n', 'จำนวนคลินิกในโรงพยาบาลทั้งหมด*, จำนวนคลินิกที่เปิดให้บริการ telemedicine*', 0, '0', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('24', 'KR 9 : ร้อยละของประชาชนที่เข้ารับการตรวจรักษา/พบแพทย์ได้รับการให้บริการด้านการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม telemedicine ผ่านแอพหมอ กทม. เทียบกับทุก Platform (P154)', 20, 2, 'นิยาม\nการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine) ผ่านแอพ หมอ กทม. หมายถึง การตรวจรักษา/การพบแพทย์/การให้บริการด้านการรักษาผู้ป่วยด้วยระบบ       โทรเวชกรรม (Telemedicine) ที่มีการรับบริการผ่านแอพพลิเคชัน หมอ กทม.\nการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine) ทุก Platform หมายถึง โรงพยาบาลมีการให้บริการครอบคลุมการรักษา การประเมินอาการ ความรุนแรง การให้คำปรึกษา หรือมีการประสานส่งต่อหรือติดตามอาการผู้ป่วยผ่านระบบโทรเวชกรรม (Telemedicine) ทุกแพลตฟอร์ม ของโรงพยาบาลในสังกัดสำนักการแพทย์ โดยมีกลุ่มเป้าหมายประกอบด้วย ผู้ป่วยโรคทั่วไปครอบคลุม 42 กลุ่มโรค/อาการ ตามประกาศของสำนักงานหลักประกันสุขภาพแห่งชาติ (สปสช.) ผู้ป่วยกลุ่มเปราะบาง ผู้ป่วยติดบ้านติดเตียง ผู้สูงอายุ ผู้พิการ หรือที่แพทย์เห็นสมควร\n\nวิธีการคำนวณ\nจำนวนผู้ป่วยที่มีการตรวจรักษา/พบแพทย์/การให้บริการด้านการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine) ผ่านแอพ หมอ กทม. หารด้วย จำนวนผู้ป่วยที่มีการตรวจรักษา/พบแพทย์/การให้บริการด้านการรักษาผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine) ทุก Platform      คูณด้วย 100\n', 'การรับบริการผ่านแอพพลิเคชัน \"หมอ กทม.\"_รวมผู้รับบริการ (คน), การรับบริการผ่านแอพพลิเคชัน \"หมอ กทม.\"_รวมผู้รับบริการ (ครั้ง), การรับบริการผ่านแอพพลิเคชัน \"Line\"_รวมผู้รับบริการ (คน), การรับบริการผ่านแอพพลิเคชัน \"Line\"_รวมผู้รับบริการ (ครั้ง), การรับบริการผ่านโทรศัพท์_รวมผู้รับบริการ (คน), การรับบริการผ่านโทรศัพท์_รวมผู้รับบริการ (ครั้ง), รวมผู้รับบริการ (คน)*, รวมผู้รับบริการ (ครั้ง)*', 0, '0', 9, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('25', 'KR 10 : จำนวนศูนย์เทคโนสุขภาพดีที่มีบริการ telemedicine (P154)', 100, 2, 'นิยาม\nศูนย์เทคโนสุขภาพดีที่มีบริการ telemedicine หมายถึง ศูนย์เทคโนสุขภาพที่สามารถให้บริการพบแพทย์ออนไลน์ผ่านระบบ telemedicine ในการตรวจคัดกรองสุขภาพ และสามารถรับใบรับรองแพทย์ได้ โดยไม่ต้องไปรับบริการที่โรงพยาบาล\n\nวิธีการคำนวณ\nนับจำนวน\n', 'จำนวนศูนย์เทคโนสุขภาพดี, สถานที่ตั้ง, จำนวนผู้รับบริการทั้งหมด*, จำนวนผู้รับบริการที่ใช้ telemedicine*', 1, '0', 5, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('26', 'KR 11 : ร้อยละของจำนวนคลินิกชุมชนอบอุ่นในเขตพื้นที่กทม. มีการเชื่อมโยงเครือข่ายส่งต่อผู้ป่วยผ่านระบบ e-Referral (การเชื่อมระบบการส่งตัวและข้อมูลผู้ป่วยจากเครือข่ายปฐมภูมิ คลินิกอบอุ่น ร้านยามาตรฐาน ไปยังศูนย์บริการสาธารณสุข และ รพ.) (P175)', 20, 2, 'นิยาม\nคลินิกชุมชนอบอุ่นในเขตพื้นที่กทม. มีการเชื่อมโยงเครือข่ายส่งต่อผู้ป่วยผ่านระบบ e-Referral หมายถึง  \nระบบสารสนเทศเพื่อการส่งต่อผู้ป่วย (e-Referral) สามารถเชื่อมโยงการส่งต่อผู้ป่วยกับคลินิกชุมชนอบอุ่นในเขตพื้นที่ กทม. ให้สามารถส่งต่อผู้ป่วยมายังโรงพยาบาล \n\n\nวิธีการคำนวณ\nจำนวนคลินิกชุมชนอบอุ่นที่มีการเชื่อมโยงเครือข่ายส่งต่อผู้ป่วยผ่านระบบ e-Referral หารด้วย จำนวนคลินิกชุมชนอบอุ่นในเขตพื้นที่ กทม. ที่ขึ้นทะเบียนกับ สปสช. ทั้งหมด คูณด้วย 100\n', 'จำนวนคลินิกชุมชนอบอุ่นในเขตพื้นที่กทม. มีการเชื่อมโยงเครือข่ายส่งต่อผู้ป่วยผ่านระบบ e-Referral, จำนวนคลินิกชุมชนอบอุ่นในเขตพื้นที่กทม. มีการเชื่อมโยงเครือข่ายส่งต่อผู้ป่วยผ่านระบบ e-Referral*', 1, '0', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('27', 'KR 12 : จำนวนร้านขายยาในเขตพื้นที่กทม. มีการเชื่อมโยงเครือข่ายส่งต่อผู้ป่วยผ่านระบบ e-Referral (การเชื่อมระบบการส่งตัวและข้อมูลผู้ป่วยจากเครือข่ายปฐมภูมิ คลินิกอบอุ่น ร้านยามาตรฐาน ไปยังศูนย์บริการสาธารณสุข        และ รพ.) (P175)', 100, 2, 'นิยาม\nการเชื่อมระบบการส่งตัวและข้อมูลผู้ป่วยจากเครือข่ายปฐมภูมิ คลินิกอบอุ่น ร้านยามาตรฐาน ไปยังศูนย์บริการสาธารณสุข และ รพ. หมายถึง การเชื่อมโยงระบบสารสนเทศโรงพยาบาลเข้ากับระบบสารสนเทศการจ่ายยาตามใบสั่งแพทย์ ของสำนักงานหลักประกันสุขภาพแห่งชาติ\n\nวิธีการคำนวณ\nนับจำนวน\n', 'ระบุ ชื่อ สถานที่ตั้ง ของร้านขายยา, จำนวนร้านขายยาในเขตพื้นที่กทม. มีการเชื่อมโยงเครือข่ายส่งต่อผู้ป่วยผ่านระบบ e-Referral *', 1, '0', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23'),
('3.1', 'KPI 1.5.2.2 : มีการคัดกรองและประเมินความเสี่ยงในกลุ่มโรคไม่ติดต่อในเขตเมือง', 35, 1, 'นิยาม\r\nผู้ป่วยโรคเบาหวาน (E10-E14) และ/หรือ ความดันโลหิตสูง (I10-I15) อายุ 35-60 ปีที่ขึ้นทะเบียน ได้รับการประเมินโอกาสเสี่ยงต่อการเกิดโรคหัวใจและหลอดเลือด (CVD Risk) ใน 10 ปีข้างหน้าที่มีระดับความเสี่ยงสูง CVD Risk ≥ 20% ได้รับการปรับเปลี่ยนพฤติกรรมและ/หรือได้รับการรักษาที่เหมาะสม อาทิ การได้รับยาลดไขมันการควบคุมระดับน้ำตาล และความดันโลหิตได้ ฯลฯ แล้วมีระดับความเสี่ยง CVD Risk ลดลง \r\n1. ผู้ที่ได้รับการประเมินโอกาสเสี่ยงต่อโรคหัวใจและหลอดเลือด (CVD Risk) และมีความเสี่ยงสูง หมายถึง ผู้ป่วยโรคเบาหวาน (E10-E14) และ/หรือ ความดันโลหิตสูง (I10-I15) อายุ 35-60 ปีที่ขึ้นทะเบียน ได้รับการประเมินโอกาสเสี่ยงต่อการเกิดโรคหัวใจและหลอดเลือด (CVD Risk) ใน 10 ปีข้างหน้า ที่มีระดับความเสี่ยงสูง CVD Risk ≥ 20%\r\n	 2. ผู้ป่วยเบาหวาน ความดันโลหิตสูงที่ขึ้นทะเบียน หมายถึง ผู้ป่วยอายุ 35 - 60 ปี ที่ได้รับการวินิจฉัยว่าเป็นโรคเบาหวาน และ/หรือ ความดันโลหิตสูง และได้รับการรักษาในโรงพยาบาลสังกัดสำนักการแพทย์\r\n	3. การเข้าสู่กระบวนการ หมายถึง ผู้ป่วยที่ได้รับการประเมินโอกาสเสี่ยงต่อการเกิดโรคหัวใจและหลอดเลือด (CVD Risk) ใน 10 ปีข้างหน้า ที่มีระดับความเสี่ยงสูง CVD Risk ≥ 20% ได้เข้ารับการปรับเปลี่ยนพฤติกรรมที่สอดคล้องกับความเสี่ยง เช่น  การให้คำปรึกษาเรื่องงดบุหรี่ การปรับพฤติกรรมการรับประทานอาหาร ลดไขมัน ลดเกลือ เป็นต้น และ/หรือได้รับการรักษาที่เหมาะสม อาทิ การได้รับยาลดไขมันการควบคุมระดับน้ำตาล และความดันโลหิตได้ ฯลฯ\r\nหมายเหตุ : รหัส ICD10 ที่จะนำมาประเมิน CVD Risk ได้แก่ \r\n	1. รหัสโรคเบาหวาน E10. - E14. (นับทุกจุดที่ตามหลังรหัส) ยกเว้น รหัส  E10. - E14. ร่วมกับ I60 - I69 ในทุกประเภทการวินิจฉัย (Dx type) รหัสโรคความดันโลหิตสูง I10 - I15 ยกเว้นรหัส I11.0,I11.9, I13.0,I13.1, I13.2, I13.9 และรหัส I10 - I15 ร่วมกับ I60 - I69 ในทุกประเภทการวินิจฉัย (Dx type)\r\n	2. กลุ่มเป้าหมาย ได้แก่ ผู้ที่ได้รับการประเมิน Thai CVD Risk และมีความเสี่ยงสูง (โดยใช้ผลเลือดในการคำนวณ) ระหว่างวันที่ 1 ตุลาคม 2566 - 31 มกราคม 2567 (เนื่องจากต้องใช้ระยะเวลาในการประเมินหลังการปรับเปลี่ยนพฤติกรรมและ/หรือได้รับการรักษาที่เหมาะสม 6 เดือน)\r\nวิธีการคำนวณ\r\nผู้ป่วยโรคเบาหวาน (E10 - E14) และ/หรือความดันโลหิตสูง (I10-I15) อายุ 35 - 60 ปีที่ขึ้นทะเบียน ได้รับการประเมินโอกาสเสี่ยงต่อการเกิดโรคหัวใจและหลอดเลือด (CVD Risk) ใน 10 ปีข้างหน้า ที่มีระดับความเสี่ยงสูง CVD Risk ≥ 20% เข้าสู่กระบวนการ แล้วมีระดับความเสี่ยง CVD Risk ลดลง หารด้วย ผู้ป่วยโรคเบาหวาน (E10-E14) และ/หรือความดันโลหิตสูง (I10-I15) อายุ 35 - 60 ปีที่ขึ้นทะเบียน ได้รับการประเมินโอกาสเสี่ยงต่อการเกิดโรคหัวใจและหลอดเลือด (CVD Risk) ใน 10 ปีข้างหน้า ที่มีระดับความเสี่ยงสูง CVD Risk ≥ 20% ทั้งหมด คูณ 100\r\n\r\n', 'ผู้ป่วยเบาหวาน (1) _1.1 จน.ผู้ป่วยได้รับการประเมิน Thai CVD Risk, ผู้ป่วยเบาหวาน (1) _1.2 จน.ผู้ป่วย CVD Risk เสี่ยงสูง เปลี่ยนพฤติกรรม+รักษา, ผู้ป่วยเบาหวาน (1) _1.3 จน.ผู้ป่วยเปลี่ยนพฤติกรรม+รักษา แล้ว CVD Risk ลดลง, ผู้ป่วยความดัน โลหิตสูง (2)_2.1 จน.ผู้ป่วยได้รับการประเมิน Thai CVD Risk, ผู้ป่วยความดัน โลหิตสูง (2)_2.2 จน.ผู้ป่วย CVD Risk เสี่ยงสูง เปลี่ยนพฤติกรรม+รักษา, ผู้ป่วยความดัน โลหิตสูง (2)_2.3 จน.ผู้ป่วยเปลี่ยนพฤติกรรม+รักษา แล้ว CVD Risk ลดลง, ผู้ป่วยที่เป็นทั้งโรคเบาหวานและ ความดันโลหิตสูง (3)_3.1 จน.ผู้ป่วยได้รับการประเมิน Thai CVD Risk, ผู้ป่วยที่เป็นทั้งโรคเบาหวานและ ความดันโลหิตสูง (3)_3.2 จน.ผู้ป่วย CVD Risk เสี่ยงสูง เปลี่ยนพฤติกรรม+รักษา, ผู้ป่วยที่เป็นทั้งโรคเบาหวานและ ความดันโลหิตสูง (3)_3.3 จน.ผู้ป่วยเปลี่ยนพฤติกรรม+รักษา แล้ว CVD Risk ลดลง, รวมผู้ป่วยทั้งหมด (4)_4.1 จน.ผู้ป่วยได้รับการประเมิน Thai CVD Risk, รวมผู้ป่วยทั้งหมด (4)_4.2 จน.ผู้ป่วย CVD Risk เสี่ยงสูง เปลี่ยนพฤติกรรม+รักษา*, รวมผู้ป่วยทั้งหมด (4)_4.3 จน.ผู้ป่วยเปลี่ยนพฤติกรรม+รักษา แล้ว CVD Risk ลดลง*', 1, '0', 12, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('3.2', 'KPI 1.5.2.2 : มีการคัดกรองและประเมินความเสี่ยงในกลุ่มโรคไม่ติดต่อในเขตเมือง การคัดกรองความเสี่ยงด้านสุขภาพจิตและนำเข้าสู่ระบบการรักษาอย่างต่อเนื่องเพิ่มขึ้นจากปี 66 ร้อยละ 2', 2, 1, 'นิยาม\nการคัดกรองความเสี่ยงด้านสุขภาพจิต  หมายถึง ผู้ที่มารับบริการในโรงพยาบาลสังกัดสำนักการแพทย์ได้รับการ\nประเมินภาวะซึมเศร้าด้วยแบบประเมิน 2 คำถาม (2Q) \nการเข้าสู่ระบบการรักษาอย่างต่อเนื่อง หมายถึง ผู้ป่วยที่ได้รับการวินิจฉัยจากแพทย์ว่าเป็นผู้ป่วยโรคซึมเศร้าได้รับการรักษาครั้งแรกและได้รับการติดตามรักษาอย่างต่อเนื่องภายใน 6 เดือน\n\nวิธีการคำนวณ\nA  = จำนวนผู้รับบริการได้การคัดกรองความเสี่ยงด้านสุขภาพจิตและนำเข้าสู่ระบบการรักษาอย่างต่อเนื่องในปีงบประมาณ พ.ศ.2567\nB  = จำนวนผู้รับบริการได้การคัดกรองความเสี่ยงด้านสุขภาพจิตและนำเข้าสู่ระบบการรักษาอย่างต่อเนื่องในปีงบประมาณ พ.ศ.2566\nA - B x 100\n                    B\n', 'จำนวนผู้มารับบริการได้รับการประเมินภาวะซึมเศร้าด้วยแบบประเมิน 2 คำถาม (2Q) (1), จำนวนผู้ที่ได้รับการประเมิน 2 คำถาม (2Q) และได้รับการวินิจฉัยว่าเป็นโรคซึมเศร้า  (2) *, จำนวนผู้ป่วยโรคซึมเศร้าจากการคัดกรองตามข้อ (1) ได้รับการรักษาครั้งแรกและได้รับการติดตามรักษาอย่างต่อเนื่องภายใน 6 เดือน*', 1, '0', 4, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('30', 'KR 14 : ร้อยละของประชาชนในเขตพื้นที่บริการของ 7 Health zone ลงทะเบียนเข้าใช้บริการศูนย์สอบถามปัญหาสุขภาพ Call Center  \n(P224)\n\n(จำนวนประชาชนที่ใช้บริการ call center (อัตราส่วนเพิ่มมากขึ้น))\n', 100, 2, 'นิยาม\nประชาชนที่ในเขตพื้นที่บริการของ 7 Health zone ลงทะเบียนเข้าใช้บริการศูนย์สอบถามปัญหาสุขภาพ Call Center หมายถึง ประชาชนที่ใช้บริการศูนย์สอบถามปัญหาสุขภาพ Call Center ผ่านศูนย์สนับสนุนบริการสุขภาพเวชศาสตร์เขตเมือง (Urban Medicine Service Center, UMSC) \n\nวิธีการคำนวณ\nA = จำนวนประชาชนที่ใช้บริการศูนย์สอบถามปัญหาสุขภาพ Call Center ผ่านศูนย์สนับสนุนบริการเวชศาสตร์เขตเมือง (Urban Medicine Service Center, UMSC) ในปี 2567  \nB = จำนวนประชาชนที่ใช้บริการศูนย์สอบถามปัญหาสุขภาพ Call Center ผ่านศูนย์สนับสนุนบริการเวชศาสตร์เขตเมือง (Urban Medicine Service Center, UMSC)  ในปี 2566 \n                         = A - B  X 100\n                              B\n', 'จำนวนประชาชนที่ใช้บริการศูนย์สอบถามปัญหาสุขภาพผ่าน (UMSC) (ครั้ง)*', 1, '0', 2, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('31', 'KR 15 : ร้อยละของนักเรียนกลุ่มเป้าหมายในโรงเรียนสังกัดกรุงเทพมหานครได้รับการฝึกทักษะการปฐมพยาบาลเบื้องต้นในการฟื้นคืนสัญญาณชีพ (CPR) (P237)', 100, 1, 'นิยาม\nนักเรียนกลุ่มเป้าหมายในโรงเรียนพื้นที่กรุงเทพมหานคร ได้รับการฝึกทักษะ การปฐมพยาบาล เบื้องต้นในการฟื้นคืนสัญญาณชีพ (CPR) หมายถึง นักเรียนกลุ่มเป้าหมายในโรงเรียนสังกัดกรุงเทพมหานครที่ขอรับการฝึกทักษะ การปฐมพยาบาล เบื้องต้นในการฟื้นคืนสัญญาณชีพ (CPR) โดยผู้ฝึกสอนที่ผ่านการอบรมการช่วยฟื้นคืนชีพขั้นพื้นฐาน(CPR) และการใช้เครื่องกระตุกหัวใจไฟฟ้าอัตโนมัติ (AED) \n\nวิธีการคำนวณ\nจำนวนนักเรียนกลุ่มเป้าหมายในโรงเรียนพื้นที่ กรุงเทพมหานครที่ได้รับการฝึกทักษะการปฐมพยาบาล เบื้องต้นในการฟื้นคืนสัญญาณชีพ (CPR) โดยผู้สอนที่ผ่านการอบรมการช่วยฟื้นคืนชีพขั้นพื้นฐาน(CPR) และการใช้เครื่องกระตุกหัวใจไฟฟ้าอัตโนมัติ (AED) หารด้วย จำนวนนักเรียนกลุ่มเป้าหมายในโรงเรียนพื้นที่กรุงเทพมหานครที่ขอรับการฝึกทักษะทั้งหมด คูณด้วย 100\n', 'จำนวนนักเรียนกลุ่มเป้าหมายในโรงเรียนพื้นที่ กรุงเทพมหานครที่ได้รับการฝึกทักษะการปฐมพยาบาล เบื้องต้นในการฟื้นคืนสัญญาณชีพ (CPR) โดยผู้สอนที่ผ่านการอบรมการช่วยฟื้นคืนชีพขั้นพื้นฐาน(CPR) และการใช้เครื่องกระตุกหัวใจไฟฟ้าอัตโนมัติ (AED), จำนวนนักเรียนกลุ่มเป้าหมายในโรงเรียนพื้นที่กรุงเทพมหานครที่ขอรับการฝึกทักษะทั้งหมด*', 1, '0', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23'),
('32', 'KR 16 : ร้อยละของนักเรียนกลุ่มเป้าหมายในโรงเรียนนอกสังกัดกรุงเทพมหานครได้รับการฝึกทักษะการปฐมพยาบาลเบื้องต้นในการฟื้นคืนสัญญาณชีพ (CPR)  (P237) ', 80, 1, 'นักเรียนกลุ่มเป้าหมายในสถาบันการศึกษานอกสังกัดกรุงเทพมหานครที่ขอรับการสนับสนุน หมายถึง นักเรียน กลุ่มเป้าหมายในสถาบันการศึกษานอกสังกัดกรุงเทพมหานคร ที่ขอรับการ สนับสนุนวิทยากรในการฝึกอบรมการช่วยฟื้นคืนชีพขั้นพื้นฐาน(CPR) และการใช้เครื่องกระตุกหัวใจไฟฟ้าอัตโนมัติ (AED)\n\nวิธีการคำนวณ\nจำนวนสถาบันการศึกษานอกสังกัดกรุงเทพมหานคร ที่ได้รับการสนับสนุนวิทยากรการฝึกอบรมการช่วยฟื้นคืนชีพขั้นพื้นฐาน(CPR) และการใช้เครื่องกระตุกหัวใจไฟฟ้าอัตโนมัติ (AED) และได้รับการสนับสนุนวิทยากร หารด้วย จำนวนสถาบันการศึกษานอกสังกัดกรุงเทพมหานคร       ที่ขอรับการสนับสนุนวิทยากรการฝึกอบรมฯ ทั้งหมด    คูณด้วย 100\n', 'จำนวนสถาบันการศึกษานอกสังกัดกรุงเทพมหานคร ที่ได้รับการสนับสนุนวิทยากรการฝึกอบรมการช่วยฟื้นคืนชีพขั้นพื้นฐาน(CPR) และการใช้เครื่องกระตุกหัวใจไฟฟ้าอัตโนมัติ (AED) และได้รับการสนับสนุนวิทยากร *, จำนวนสถาบันการศึกษานอกสังกัดกรุงเทพมหานคร ที่ขอรับการสนับสนุนวิทยากรการฝึกอบรมฯ ทั้งหมด*', 1, '', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23'),
('33', 'KR 17 : ร้อยละของพื้นที่ที่มีความจำเป็นและความต้องการจากผลการสำรวจไดัรับการติดตั้งเครื่อง AED ในพื้นที่สาธารณะและชุมชน (จำนวนเครื่อง AED ที่มีการสั่งซื้อเพิ่ม และสั่งซื้อทดแทน) (P 238)', 80, 1, 'นิยาม\n\nพื้นที่สาธารณะ หมายถึง สวนสาธารณะและโรงเรียนในสังกัดกรุงเทพมหานคร ที่ได้รับการสำรวจและมีความจำเป็นต้องติดตั้งเครื่อง AED ได้รับการติดตั้งเครื่อง\nชุมชน หมายถึง ชุมชนจัดตั้งที่ขึ้นทะเบียนของ AED \nกรุงเทพมหานคร ที่ได้รับการสำรวจและมีความจำเป็นต้องติดตั้งเครื่อง AED ได้รับการติดตั้งเครื่อง\n\nวิธีการคำนวณ\nจำนวนพื้นที่สาธารณะและชุมชนที่ได้รับการสำรวจและมีความจำเป็นจำเป็นต้องติดตั้งเครื่อง AED ได้รับการติดตั้งเครื่อง AED หารด้วยจำนวนพื้นที่สาธารณะและชุมชนที่ได้รับการสำรวจและมีความจำเป็นต้องติดตั้งทั้งหมด      คูณด้วย 100\n', 'จำนวนพื้นที่สาธารณะและชุมชนที่ได้รับการสำรวจและมีความจำเป็นจำเป็นต้องติดตั้งเครื่อง AED ได้รับการติดตั้งเครื่อง AED, ด้วย จำนวนพื้นที่สาธารณะและชุมชนที่ได้รับการสำรวจและมีความจำเป็นต้องติดตั้งทั้งหมด*', 1, '', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23'),
('34', 'ตัวชี้วัด KR 34 : ระยะเวลาเฉลี่ยในการออกบัตรคนพิการ ณ โรงพยาบาล', 60, 1, 'นิยาม : \nระยะเวลาในการออกบัตรประจำตัวคนพิการ หมายถึง ระยะเวลาตั้งแต่ผู้มารับบริการเริ่มยื่นเอกสารคำขอออกบัตรประจำตัว\nเป้าหมาย : \nร้อยละ 60 (ให้บริการภายใน 30 นาที)', 'จำนวนคนพิการที่ได้รับบริการออกบัตรประจำตัวคนพิการภายใน 1 วัน ทั้งหมด (ราย) (1)*, จำนวนคนพิการที่ได้รับบริการออกบัตรประจำตัว คนพิการ ภายใน 30 นาที (ราย) (2)*', 1, '0', 3, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('4', 'KPI 1.5.4.2 : อัตราการรักษาสำเร็จในผู้ป่วยวัณโรค', 89, 1, 'นิยาม\n1 ความสำเร็จของการรักษา หมายถึง ผู้ป่วยวัณโรคปอดรายใหม่ที่มีผลการรักษาหายรวมกับรักษาครบ \n       1.1 รักษาหาย (Cured) หมายถึง ผู้ป่วยวัณโรคปอดรายใหม่ที่มีผลตรวจทางห้องปฏิบัติการพบเชื้อวัณโรคก่อนเริ่มการรักษา และต่อมาตรวจไม่พบเชื้อวัณโรคอย่างน้อยหนึ่งครั้งก่อนสิ้นสุดการรักษา และในเดือนสุดท้ายของการรักษา\n1.2 รักษาครบ (Treatment Completed) หมายถึง ผู้ป่วยวัณโรคปอดรายใหม่ที่รักษาครบกำหนดโดยไม่มีหลักฐานที่แสดงว่าการรักษาล้มเหลว ซึ่งผู้ป่วยดังกล่าวไม่มีเอกสารที่แสดงผลการตรวจเสมหะในเดือนสุดท้ายของการรักษา ทั้งนี้มีผลตรวจเสมหะเป็นลบอย่างน้อยหนึ่งครั้งก่อนสิ้นสุดการรักษา รวมทั้งผู้ป่วยที่ไม่ได้ตรวจหรือไม่มีผลตรวจ\n2 ผู้ป่วยวัณโรคปอดรายใหม่ หมายถึง ผู้ป่วยวัณโรคปอดที่ไม่เคยรักษาวัณโรคมาก่อนและผู้ป่วยที่รักษาวัณโรคน้อยกว่า 1 เดือน และไม่เคยขึ้นทะเบียนในแผนงานวัณโรคแห่งชาติ แบ่งเป็น 2 \nกลุ่ม คือ\n2.1 ผู้ป่วยที่มีผลตรวจยืนยันพบเชื้อวัณโรค (Bacteriologically confirmed: B+) หมายถึง ผู้ป่วยวัณโรคที่มีผลตรวจเสมหะเป็นบวก อาจจะเป็นการตรวจด้วยวิธี Smear microscopy หรือ Culture หรือวิธี Molecular หรือวิธีการอื่นๆ ที่องค์การอนามัยโลกรับรอง \n2.2 ผู้ป่วยที่วินิจฉัยด้วยลักษณะทางคลินิก (Clinically diagnosed: B-) หมายถึง ผู้ป่วยวัณโรคที่มีผลตรวจเสมหะเป็นลบ หรือไม่มีผลตรวจ แต่ผลการวินิจฉัยด้วยวิธีการตรวจเอกซเรย์รังสีทรวงอกหรือผลการตรวจชิ้นเนื้อผิดปกติเข้าได้กับวัณโรค ร่วมกับมีลักษณะทางคลินิกเข้าได้กับวัณโรค และแพทย์ตัดสินใจรักษาด้วยสูตรยารักษาวัณโรค\n\nวิธีการคำนวณ\nอัตราผลสำเร็จในการรักษา เท่ากับจำนวนผู้ป่วยที่รักษาหาย รวมกับจำนวนผู้ป่วยที่รักษาครบ ที่ขึ้นทะเบียนรักษาตั้งแต่รอบที่ 1 - 4 /2566 ในโรงพยาบาล 9 แห่ง หารด้วย จำนวนผู้ป่วยวัณโรคปอดรายใหม่ที่ขึ้นทะเบียนทั้งหมดในโรงพยาบาล 9 แห่ง ในรอบดังกล่าว คูณ 100 \n', 'จำนวนผู้ป่วยวัณโรคปอดรายใหม่ที่ขึ้นทะเบียนรักษา_ผลตรวจยืนยันพบเชื้อ (B+) (ราย), จำนวนผู้ป่วยวัณโรคปอดรายใหม่ที่ขึ้นทะเบียนรักษา_วินิจฉัยด้วยลักษณะทางคลินิก (B-) (ราย), จำนวนผู้ป่วยวัณโรคปอดรายใหม่ที่ขึ้นทะเบียนรักษา_รวมจำนวนผู้ป่วยใหม่ที่ขึ้นทะเบียนรักษา*, ผลการรักษาหาย (Cure Rate) (ราย), ผลการรักษาครบ (Complete Rate) (ราย), ผลความสำเร็จการรักษา (Cure+Complete) (ราย)*', 1, '0', 6, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('41', 'ร้อยละของการรักษาพยาบาลด้วยระบบโทรเวชกรรม (Telemedicine) ผ่าน App หมอ กทม. ของโรงพยาบาลสังกัดสำนักการแพทย์ ', 100, 2, 'นิยาม  \nการรักษาพยาบาลด้วยระบบโทร      เวชกรรม (Telemedicine) ผ่าน App หมอ กทม.ของโรงพยาบาลสังกัดสำนักการแพทย์ หมายถึง แพทย์ในโรงพยาบาลในสังกัดสำนักการแพทย์ สามารถตรวจวินิจฉัย ประเมินอาการ หรือให้คำแนะนำเกี่ยวกับอาการเจ็บป่วยเบื้องต้นที่ไม่รุนแรง ให้กับผู้ป่วยด้วยระบบโทรเวชกรรม (Telemedicine) ผ่าน App หมอ กทม.โดยมีกลุ่มเป้าหมายประกอบด้วยผู้ป่วยโรคทั่วไปครอบคลุม 42 กลุ่มโรค/อาการ ตามประกาศของสำนักงานหลักประกันสุขภาพแห่งชาติ (สปสช.) ผู้ป่วยกลุ่มเปราะบางผู้ป่วยติดบ้านติดเตียง ผู้สูงอายุ ผู้พิการ หรือที่แพทย์เห็นสมควร\nผู้ป่วยนอก หมายถึง ผู้ป่วยโรคทั่วไปครอบคลุม 42 กลุ่มโรค/อาการ ตามประกาศของสำนักงานหลักประกันสุขภาพแห่งชาติ (สปสช.) หรือที่แพทย์เห็นสมควร\nวิธีคำนวณ/วัดผลการดำเนินงาน/สูตรคำนวณ\nจำนวนผู้รับบริการรักษาพยาบาลด้วยระบบโทรเวชกรรม (Telemedicine) ผ่าน App หมอ กทม. หารด้วย จำนวนผู้ป่วยนอก (OPD) 42 กลุ่มโรค/อาการ ตามประกาศของสำนักงานหลักประกันสุขภาพแห่งชาติ (สปสช.) หรือที่แพทย์เห็นสมควร ที่มารับบริการในโรงพยาบาลสังกัดสำนักการแพทย์ทั้งหมด คูณด้วย 100\n\nวิธีเก็บข้อมูล/หลักฐาน\n1. เก็บข้อมูลจากระบบสารสนเทศของโรงพยาบาล (Hospital Information System: HIS)\n2. รายงานผลการดำเนินงาน ปัญหา อุปสรรค และข้อเสนอแนะในการดำเนินงาน\n', 'ผู้ให้บริการเป็นแพทย์_จำนวนรับบริการ (คน), ผู้ให้บริการเป็นแพทย์_จำนวนรับบริการ (ครั้ง), ผู้ให้บริการเป็นพยาบาล_จำนวนรับบริการ (คน), ผู้ให้บริการเป็นพยาบาล_จำนวนรับบริการ (ครั้ง), ผู้ให้บริการเป็นเภสัชกร_จำนวนรับบริการ (คน), ผู้ให้บริการเป็นเภสัชกร_จำนวนรับบริการ (ครั้ง), จำนวนรับบริการ (คน)*, จำนวนรับบริการ (ครั้ง)*', 0, '0', 9, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('5', 'KPI 1.5.4.5 : อัตราป่วยตายด้วยโรคติดเชื้อไวรัสโคโรนา 2019 (โควิด 19)', 100, 1, 'คำนิยาม \n1. โรคติดเชื้อไวรัสโคโรนา 2019       (โรคโควิด19) หมายถึง การติดเชื้อไวรัส โคโรนา 2019 ทั้งที่มีอาการและไม่มีอาการ โดยมีผลตรวจทางห้องปฏิบัติการยืนยันเป็นบวก\n2. อัตราป่วยตายไม่เกินค่าเป้าหมาย หมายถึง อัตราป่วยตายของผู้ป่วยโรคติดเชื้อไวรัสโคโรนา 2019 ของสำนักการแพทย์ ไม่เกินร้อยละ 0.1 (ตั้งแต่วันที่ 1 ต.ค.66 – 30 ก.ย.67) โดยนับผู้ป่วยทุกรายที่มีผลทางห้องปฏิบัติการยืนยันเป็นบวก\n วิธีการคำนวณ\nจำนวนผู้เสียชีวิตจากโรคติดเชื้อไวรัส       โคโรนา 2019 ในโรงพยาบาลสังกัดสำนักการแพทย์ หารด้วย จำนวนผู้ป่วยยืนยันโรคติดเชื้อไวรัสโคโรนา 2019 ที่มารับบริการในสังกัดสำนักการแพทย์ คูณด้วย 100\n', 'จำนวนผู้ป่วย COVID-19_ผู้ป่วยนอก (ราย), จำนวนผู้ป่วย COVID-19_ผู้ป่วยใน (ราย), รวมผู้ป่วย  COVID-19 (ราย)*, จำนวนผู้ป่วย COVID-19  เสียชีวิต (ราย)*', 1, '0', 5, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23'),
('8', 'KPI 1.5.5.3 เพิ่มศักยภาพการดูแลสุขภาพคนเมืองที่บ้าน (Urban Medicine Home Care) ผ่านระบบ Telemedicine ที่เชื่อมต่อบนแอปพลิเคชันเดียว ', 90, 1, 'นิยาม : \n1. ผู้สูงอายุที่อยู่ในภาวะพึ่งพิง หมายถึง ผู้สูงอายุที่มีข้อจำกัดในการทำกิจวัตรประจำวัน (ADLs) ในระดับพึ่งพิงทั้งหมดและพึ่งพิงเป็นส่วนมากที่ต้องการการเยี่ยมบ้านหรือการดูแลแบบประคับประคองได้รับบริการตามมาตรฐานในมิติสุขภาพจากโรงพยาบาลในสังกัดสำนักการแพทย์ \n(ADL ≤ 11 คะแนน) \n2. บริการตามมาตรฐาน หมายถึง การให้บริการด้านสุขภาพเพื่อการดูแลผู้สูงอายุขั้นพื้นฐานที่จำเป็น เช่น การคัดกรองปัญหาสำคัญและโรคที่พบบ่อยในผู้สูงอายุ การคัดกรองกลุ่ม Geriatric syndromes การประเมินสมรรถนะผู้สูงอายุเพื่อการดูแล เป็นต้น รวมถึงการเยี่ยมบ้านแบบบูรณาการร่วมกับหน่วยงานที่เกี่ยวข้อง ให้ได้รับการดูแลต่อเนื่องที่บ้านสำหรับผู้ป่วยสูงอายุที่มีค่าประเมินการใช้ชีวิตประจำวัน ADL ≤ 11 คะแนน เพื่อให้การรักษาและฟื้นฟูในด้านมิติสุขภาพ รวมถึงมิติสังคม \n\nเป้าหมาย :\n ผู้ป่วยและผู้สูงอายุที่อยู่ในภาวะพึ่งพิงและต้องการการเยี่ยมบ้านหรือดูแลแบบประคับประคองได้รับการพยาบาลต่อเนื่องที่บ้าน ร้อยละ 90', 'ผู้สูงอายที่รับบริการในคลินิกผู้สูงอายุคุณภาพทั้งหมด (ราย)   (1), จำนวนผู้สูงอายุที่อยู่ในภาวะพึ่งพิงและต้องการการเยี่ยมบ้านหรือการดูแลแบบประคับประคองทั้งหมด (ราย)  (2), จำนวนผู้สูงอายุที่อยู่ในภาวะพึ่งพิงและต้องการ การเยี่ยมบ้านหรือการดูแลแบบประคับประคอง ได้รับบริการตามมาตรฐาน (3)_การเยี่ยมบ้าน  (ราย)  (3.1), จำนวนผู้สูงอายุที่อยู่ในภาวะพึ่งพิงและต้องการ การเยี่ยมบ้านหรือการดูแลแบบประคับประคอง ได้รับบริการตามมาตรฐาน (3)_ดูแลผ่าน Telemedicine  (ราย)  (3.2)*, จำนวนผู้สูงอายุที่อยู่ในภาวะพึ่งพิงและต้องการ การเยี่ยมบ้านหรือการดูแลแบบประคับประคอง ได้รับบริการตามมาตรฐาน (3)_รวม   (3.1+3.2)*', 1, '0', 6, '10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 23');

-- --------------------------------------------------------

--
-- Table structure for table `formed`
--

CREATE TABLE `formed` (
  `fd_id` int NOT NULL,
  `us_id` int NOT NULL,
  `de_id` int NOT NULL,
  `fd_date` date NOT NULL,
  `fd_time` time NOT NULL,
  `fd_update` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `result`
--

CREATE TABLE `result` (
  `re_id` int NOT NULL,
  `fm_id` varchar(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `h1` float DEFAULT '0',
  `h1pa` int DEFAULT '0',
  `h1pb` int DEFAULT '0',
  `h2` float DEFAULT '0',
  `h2pa` int DEFAULT '0',
  `h2pb` int DEFAULT '0',
  `h3` float DEFAULT '0',
  `h3pa` int DEFAULT '0',
  `h3pb` int DEFAULT '0',
  `h4` float DEFAULT '0',
  `h4pa` int DEFAULT '0',
  `h4pb` int DEFAULT '0',
  `h5` float DEFAULT '0',
  `h5pa` int DEFAULT '0',
  `h5pb` int DEFAULT '0',
  `h6` float DEFAULT '0',
  `h6pa` int DEFAULT '0',
  `h6pb` int DEFAULT '0',
  `h7` float DEFAULT '0',
  `h7pa` int DEFAULT '0',
  `h7pb` int DEFAULT '0',
  `h8` float DEFAULT '0',
  `h8pa` int DEFAULT '0',
  `h8pb` int DEFAULT '0',
  `h9` float DEFAULT '0',
  `h9pa` int DEFAULT '0',
  `h9pb` int DEFAULT '0',
  `h10` float DEFAULT '0',
  `h10pa` int DEFAULT '0',
  `h10pb` int DEFAULT '0',
  `h11` float DEFAULT '0',
  `h11pa` int DEFAULT '0',
  `h11pb` int DEFAULT '0',
  `d1` float NOT NULL DEFAULT '0',
  `d1pa` int NOT NULL DEFAULT '0',
  `d1pb` int NOT NULL DEFAULT '0',
  `d2` float NOT NULL DEFAULT '0',
  `d2pa` int NOT NULL DEFAULT '0',
  `d2pb` int NOT NULL DEFAULT '0',
  `re_log` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT '',
  `pa1` int DEFAULT '0',
  `pa2` int DEFAULT '0',
  `re_sum` float DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `result`
--

INSERT INTO `result` (`re_id`, `fm_id`, `h1`, `h1pa`, `h1pb`, `h2`, `h2pa`, `h2pb`, `h3`, `h3pa`, `h3pb`, `h4`, `h4pa`, `h4pb`, `h5`, `h5pa`, `h5pb`, `h6`, `h6pa`, `h6pb`, `h7`, `h7pa`, `h7pb`, `h8`, `h8pa`, `h8pb`, `h9`, `h9pa`, `h9pb`, `h10`, `h10pa`, `h10pb`, `h11`, `h11pa`, `h11pb`, `d1`, `d1pa`, `d1pb`, `d2`, `d2pa`, `d2pb`, `re_log`, `pa1`, `pa2`, `re_sum`) VALUES
(17, '1.1', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(18, '3.1', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(19, '12', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(20, '34', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(21, '4', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(23, '8', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(24, '17', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(25, '3.2', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(26, '1.2', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(27, '2', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(28, '1', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(29, '41', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(30, '24', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(31, '13', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(32, '19', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(33, '33', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(34, '32', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(36, '31', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(37, '27', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(38, '26', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(39, '25', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(40, '30', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(41, '23', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0),
(43, '5', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `us_id` int NOT NULL,
  `us_email` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `us_password` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `us_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `us_agency` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `us_level` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`us_id`, `us_email`, `us_password`, `us_name`, `us_agency`, `us_level`) VALUES
(10, 'klang@gmail.con', '$2b$10$o5wl6Bdn0ufW3RnZNF2RXup1.5EBZ9Lxnm6mgZZ9iIKIXw.vXOOju', '07050000', 'รพ.กลาง', 0),
(11, 'taksin@gmail.con', '$2b$10$jqarFTg1wDloynBNP5wlA.tu4w5dJ0SgbaOQt7m6biF8vN9Vhxk5W', '07060000', 'รพ.ตากสิน', 0),
(12, 'jalean@gmail.con', '$2b$10$6g25HQIu6bhAWt7PbBT8hetrySH1t9iibnHH1Hb1aH7uGD25liQrG', '07070000', 'รพ.เจริญกรุงประชารัก', 0),
(13, 'ruangp@gmail.con', '$2b$10$SnpKKHWuicsctB9tEz8QFu2yANp7RvHdpuFN78nAClOsnbsz2572i', '07080000', 'รพ.หลวงพ่อทวีศักดิ์', 0),
(14, 'wecha@gmail.con', '$2b$10$z4Vj1rvzvudtTA4Qu.EmUOMrg9Qkif3d0Zqfy/jaWKE.bLREHRDL.', '07090000', 'รพ.เวชการุณย์รัศมิ์', 0),
(15, 'ladka@gmail.con', '$2b$10$kPZzPcFNjaK6dT5kSCGp4OTaMA3LfFp1T0DdWr4mnN3eCBGlPxLsC', '07110000', 'รพ.ลาดกระบัง', 0),
(16, 'raadp@gmail.con', '$2b$10$LCnrOOMdmoArbdatXFfGBe06NpNNnjz0r9TNDhxFobTHrfDf6LaQW', '07120000', 'รพ.ราชพิพัฒน์', 0),
(17, 'sirint@gmail.con', '$2b$10$Bgx7ZZ/HReNNCCWj6ghQO.RnzUCnInJr415J7z5GPVBIGwBH6igMq', '07130000', 'รพ.สิรินธร', 0),
(18, 'bangkt@gmail.con', '$2b$10$OVtF3vmZF0FhEyW1lhXUgusB8bQb8s42ly/PihHDLZujK9ZzGrosK', '07140000', 'รพ.ผู้สูงอายุบางขุนเทียน', 0),
(19, 'krongz@gmail.con', '$2b$10$Q7xDAj7Iq4T3kjPi3p/6ZO5XsgI25A9.FJMWeV6z.Bk60MShUY2fy', '07150000', 'รพ.คลองสามวา', 0),
(20, 'bangnaa@gmail.con', '$2b$10$BlAUZYWvhqoSP.AxHJXJaOVMzknYgJ0jLa40OLr19Jxa4fOvlgvx6', '07160000', 'รพ.บางนา', 0),
(21, 'sg@gmail.com', '$2b$10$GlSoXPh37MZNgFR6kG8uW.PihdArAMU7/t8HnGDZrqICs45W.BTKa', '07170000', 'สก.', 0),
(22, 'sbc@gmail.com', '$2b$10$lS/jYSEqEjVvJgjnCwHC2uCVbCVijyijfSIqWdgRNGL3msmITVQeS', '07180000', 'ศบฉ.', 0),
(23, 'sbp@gmail.con', '$2b$10$SdrTtyvMfdxQIzwI4NaO8.hQEfyxnf5fvM4DCblN84xGZ.EOoS6xS', '07020000', 'สพบ.', 9);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `detail`
--
ALTER TABLE `detail`
  ADD PRIMARY KEY (`de_id`);

--
-- Indexes for table `event`
--
ALTER TABLE `event`
  ADD PRIMARY KEY (`ev_id`);

--
-- Indexes for table `form`
--
ALTER TABLE `form`
  ADD PRIMARY KEY (`fm_id`);

--
-- Indexes for table `formed`
--
ALTER TABLE `formed`
  ADD PRIMARY KEY (`fd_id`);

--
-- Indexes for table `result`
--
ALTER TABLE `result`
  ADD PRIMARY KEY (`re_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`us_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `detail`
--
ALTER TABLE `detail`
  MODIFY `de_id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `event`
--
ALTER TABLE `event`
  MODIFY `ev_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT for table `formed`
--
ALTER TABLE `formed`
  MODIFY `fd_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT for table `result`
--
ALTER TABLE `result`
  MODIFY `re_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `us_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
